#                                                                             به نام خدا
# *************************************************************************************************************************************************
#                                                     می‌خواهیم یک نورون ساده را با پایتون پیاده‌سازی کنیم
# *************************************************************************************************************************************************
import numpy as np
import arabic_reshaper
#-------------------------------------------------------
# install: pip install python-bidi
from bidi.algorithm import get_display
#-------------------------------------------------------

# ورودی‌ها
x = np.array([0.5, 0.3, 0.2])

# وزن‌ها و بایاس (مقدارهای فرضی)
w = np.array([0.4, 0.6, -0.2])
b = 0.1

# محاسبه z
z = np.dot(x, w) + b
print(get_display(arabic_reshaper.reshape(f"مقدار z =: {z}")))

# تابع Sigmoid
def sigmoid(z):
    return 1 / (1 + np.exp(-z))

# خروجی نورون
y_hat = sigmoid(z)
print(get_display(arabic_reshaper.reshape(f"خروجی نورون (احتمال) =: {y_hat}")))